const mongoose = require('mongoose');

const userSchema = new mongoose.Schema({

    // =========================================================
    // HỌ TÊN
    // =========================================================

    fullName: {
        type: String,
        required: true,
        trim: true
    },


    // =========================================================
    // EMAIL
    // =========================================================

    email: {
        type: String,
        required: true,
        unique: true,
        trim: true,
        lowercase: true
    },


    // =========================================================
    // SỐ ĐIỆN THOẠI
    // =========================================================

    phone: {
        type: String,
        required: true,
        trim: true
    },


    // =========================================================
    // MẬT KHẨU
    // =========================================================

    password: {
        type: String,
        required: true
    },


    // =========================================================
    // ĐỊA CHỈ
    // =========================================================

    address: {
        type: String,
        default: ''
    },


    // =========================================================
    // AVATAR
    // =========================================================

    avatar: {
        type: String,
        default: ''
    },


    // =========================================================
    // CHỨC VỤ
    // =========================================================

    position: {
        type: String,
        default: '',
        trim: true
    },


    // =========================================================
    // TRẠNG THÁI
    // =========================================================

    status: {
        type: String,
        enum: [
            'active',
            'inactive'
        ],
        default: 'active'
    },


    // =========================================================
    // NHÓM QUYỀN
    // =========================================================

    role: {
        type: String,
        enum: [
            'customer',
            'admin',
            'tour-manager',
            'order-manager'
        ],
        default: 'customer'
    }

}, {
    timestamps: true
});


module.exports =
    mongoose.model('User', userSchema);
